package sample;

public class Data {
    public static final String DEST = "results/word.pdf";  // 生成File所在文件夹
    //
    public static final String DOG = "src/main/resources/img/dog.bmp";
    public static final String FOX = "src/main/resources/img/fox.bmp";
    public static final String LONG_ARTICLE = "一、\t本次委托理财概况\n" +
            "(一)\t委托理财目的\n" +
            "在确保公司募集资金投资项目所需资金和保证募集资金安全的前提下，合理利用部分闲置募集资金，可以提高资金使用效率和收益，进一步提升公司整体业绩水平，为公司和股东谋取更多的投资回报。\n" +
            "(二)\t你好\n" +
            "(三)\t资金来源\n" +
            "1.\t资金来源：部分闲置募集资金\n" +
            "2.\t募集资金基本情况\n" +
            "经中国证券监督管理委员会《关于核准张家港爱丽家居科技股份有限公司首次公开发行股票的批复》（证监许可[2020]38号）核准，公司获准向社会公众公开发行人民币普通股（A股）股票6,000万股，发行价为每股人民币12.90元，共计募集资金774,000,000.00元，扣除发行费用后，实际募集资金净额为706,146,698.17元。上述募集资金到位情况已经公证天业会计师事务所（特殊普通合伙）验证，并由其出具苏公W[2020]B018号《验资报告》。公司对募集资金进行了专户存储管理，募集资金到账后，已全部存放于募集资金专项账户内，并与保荐机构、存放募集资金的商业银行签署了募集资金监管协议。\n" +
            "(四)\t委托理财产品的基本情况\n" +
            "1.\t江苏张家港农村商业银行公司结构性存款2020099期\n" +
            "委托方名称\t产品类型\t产品名称\t金额（万元）\t预计年化收益率\t预计收益金额（万元）\n" +
            "江苏张家港农村商业银行合兴支行\t江苏张家港农村商业银行公司结构性存款2020099期\n" +
            "\t保本浮动收益型结构性存款产品\t3,000.00\t3.50%\t-\n" +
            "产品期限\t收益类型\t结构化安排\t参考年化收益率\t预计收益（如有）\t是否构成关联交易\n" +
            "91天\t保本浮动收益型\t-\t-\t-\t否\n" +
            "2.\t江苏张家港农村商业银行公司结构性存款2020100期\n" +
            "委托方名称\t产品类型\t产品名称\t金额（万元）\t预计年化收益率\t预计收益金额（万元）\n" +
            "江苏张家港农村商业银行合兴支行\t江苏张家港农村商业银行公司结构性存款2020100期\n" +
            "\t保本浮动收益型结构性存款产品\t3,000.00\t3.75%\t-\n" +
            "产品期限\t收益类型\t结构化安排\t参考年化收益率\t预计收益（如有）\t是否构成关联交易\n" +
            "183天\t保本浮动收益型\t-\t-\t-\t否\n" +
            "(五)\t公司对委托理财相关风险的内部控制\n" +
            "1.\t为控制风险，公司选择保本浮动收益型结构性存款产品；\n" +
            "2.\t公司将实时分析和持续跟踪产品的净值变动情况，如评估发现存在可能影响公司资金安全的风险因素，将及时采取相应措施，控制投资风险；\n" +
            "3.\t独立董事、监事会有权对资金使用情况进行监督与检查，必要时可以聘请专业机构进行审计。 \n" +
            "二、\t本次委托理财的具体情况\n" +
            "(一)\t委托理财合同主要条款\n" +
            "1.\t江苏张家港农村商业银行公司结构性存款2020099期\n" +
            "产品名称\t公司结构性存款2020099期（编号：JGCK2020099)\n" +
            "适合客户\t公司客户及定制客户\n" +
            "产品期限\t91天\n" +
            "投资及收益币种\t人民币\n" +
            "产品类型\t保本浮动收益型结构性存款产品\n" +
            "起存金额\t购买的起点金额为人民币壹万元起\n" +
            "递增金额\t壹万元\n" +
            "募集期\t2020年5月20日-5月21日\n" +
            "投资冷静期\t2020年5月20日10:00至2020年5月21日10:00\n" +
            "起息日\t2020年5月21日\n" +
            "到期日\t2020年8月20日\n" +
            "挂钩标的\t欧元兑美元汇率\n" +
            "产品预期年利率\t按照挂钩标的表现，向客户支付浮动收益\n" +
            "（1）到期观察日，若标的≤SPOT值-260bp，则利率水平＝1.5%\n" +
            "（2）到期观察日，若标的≥SPOT值+260bp，则利率水平＝1.5%；\n" +
            "（3）到期观察日，若标的在（SPOT值-260bp,SPOT值+260bp）内，则利率水平＝3.5%。\n" +
            "（4）标的观察日为到期日前两个工作日（T-2日）,SPOT值=起息日北京时间10:00标的值，1BP=1/10000。\n" +
            "募集规模\t人民币3000万元\n" +
            "提前终止条款\t无\n" +
            "工作日\t国家法定工作日\n" +
            "利息支付方式\t每期利息以人民币支付\n" +
            "2.\t江苏张家港农村商业银行公司结构性存款2020100期\n" +
            "产品名称\t公司结构性存款2020100期（编号：JGCK2020100)\n" +
            "适合客户\t公司客户及定制客户\n" +
            "产品期限\t183天\n" +
            "投资及收益币种\t人民币\n" +
            "产品类型\t保本浮动收益型结构性存款产品\n" +
            "起存金额\t购买的起点金额为人民币壹万元起\n" +
            "递增金额\t壹万元\n" +
            "募集期\t2020年5月20日-5月21日\n" +
            "投资冷静期\t2020年5月20日10:00至2020年5月21日10:00\n" +
            "起息日\t2020年5月21日\n" +
            "到期日\t2020年11月20日\n" +
            "挂钩标的\t欧元兑美元汇率\n" +
            "产品预期年利率\t按照挂钩标的表现，向客户支付浮动收益\n" +
            "（1）到期观察日，若标的≤SPOT值-360bp，则利率水平＝1.8%\n" +
            "（2）到期观察日，若标的≥SPOT值+360bp，则利率水平＝1.8%；\n" +
            "（3）到期观察日，若标的在（SPOT值-360bp,SPOT值+360bp）内，则利率水平＝3.75%。\n" +
            "（4）标的观察日为到期日前两个工作日（T-2日）,SPOT值=起息日北京时间10:00标的值，1BP=1/10000。\n" +
            "募集规模\t人民币3000万元\n" +
            "提前终止条款\t无\n" +
            "工作日\t国家法定工作日\n" +
            "利息支付方式\t每期利息以人民币支付\n" +
            "(二)\t委托理财的资金投向\n" +
            "1.\t江苏张家港农村商业银行公司结构性存款2020099期\n" +
            "本结构性存款产品由江苏张家港农村商业银行投资于中国银行间市场信用级别较高、流动性较好的金融产品，包括但不限于银行存款、货币市场产品、国债、金融债、央行票据、银行承兑汇票、商业票据、高信用级别的信用类债券（企业债、中期票据、公司债、短期融资券）、债务市场工具、银行间市场产品或监管政策允许的其它金融产品，同时银行通过主动性管理和运用结构简单、风险较低的相关金融工具来提高该产品的收益率。\n" +
            "2.\t江苏张家港农村商业银行公司结构性存款2020100期\n" +
            "本结构性存款产品由江苏张家港农村商业银行投资于中国银行间市场信用级别较高、流动性较好的金融产品，包括但不限于银行存款、货币市场产品、国债、金融债、央行票据、银行承兑汇票、商业票据、高信用级别的信用类债券（企业债、中期票据、公司债、短期融资券）、债务市场工具、银行间市场产品或监管政策允许的其它金融产品，同时银行通过主动性管理和运用结构简单、风险较低的相关金融工具来提高该产品的收益率。\n" +
            "(三)\t本次使用部分闲置募集资金进行委托理财，产品发行主体能够提供保本承诺，符合安全性高、流动性好的使用条件要求，不存在变相改变募集资金用途的行为，不影响募投项目的正常进行。\n" +
            "(四)\t在产品有效期间，公司独立董事、监事会有权对资金使用情况进行监督与检查，必要时可以聘请专业机构进行审计。公司将与产品发行机构进行密切联系，及时分析和持续跟踪委托理财的进展情况，加强检查监督和风险控制力度，一旦发现或判断有不利因素，将及时采取相应措施，保证募集资金安全。公司将按照《上市公司监管指引第 2 号——上市公司募集资金管理和使用的监管要求》、《上海证券交易所上市公司募集资金管理办法（2013 年修订）》等有关规定及时履行信息披露义务。\n" +
            "三、\t委托理财受托方的情况\n" +
            "(一)\t受托方的基本情况\n" +
            "本次委托理财受托方为江苏张家港农村商业银行股份有限公司，为深圳证券交易所上市公司，证券代码：002839，是全国首批上市农村商业银行。\n" +
            "(二)\t公司董事会尽职调查情况\n" +
            "董事会经过调查认为，公司本次委托理财产品的提供机构江苏张家港农村商业银行股份有限公司（经办行：合兴支行），主营业务正常稳定，盈利情况、资信状况和财务状况良好，符合对理财产品发行机构的选择标准，该银行与公司、公司控股股东及实际控制人不存在关联关系。\n" +
            "四、\t对公司的影响\n" +
            "公司本次使用部分闲置募集资金购买保本型理财产品，是在确保募投资金投资项目正常进行和保证募集资金安全的前提下进行的，不会影响公司募集资金项目的正常建设，亦不会影响公司募集资金的正常使用。公司本次使用募集资金购买理财产品，有利于提高募集资金使用效率，增加资金收益，为公司和股东获取较好的投资回报。\n" +
            "五、\t风险提示\n" +
            "公司使用闲置募集资金进行委托理财选择的是期限不超过12个月的安全性高、流动性好的有保本约定的结构性存款，但金融市场受宏观经济的影响较大，不排除相关投资可能受到市场波动的影响，存在无法获得预期收益的风险。\n" +
            "六、\t决策程序的履行\n" +
            "公司已于2020年4月21日召开第一届董事会第十一次会议、第一届监事会第六次会议，2020年5月7日召开2020年第一次临时股东大会，审议通过了《关于使用部分闲置募集资金进行现金管理的议案》，同意公司使用不超过人民币35,000.00万元（含）的闲置募集资金进行现金管理，用于购买一年内、保本型的银行理财产品或结构性存款等理财产品，期限不超过12个月（含），在上述期限和额度内可以循环滚动使用，期满后归还至公司募集资金专用账户。授权董事长在额度范围内行使该项投资决策权并签署相关合同文件，包括但不限于：选择合格专业理财机构作为受托方、明确委托理财金额、期间、选择委托理财产品品种、签署合同及协议等。\n" +
            "公司独立董事、监事会、保荐机构已分别对此发表同意意见。具体内容详见公司于2020年4月22日在上海证券交易所网站及指定媒体披露的《爱丽家居关于使用部分闲置募集资金进行现金管理的公告》（公告编号：临2020-007）。\n" +
            "七、\t截至本公告日，公司最近十二个月使用募集资金委托理财的情况\n" +
            "金额：万元\n" +
            "序号\t理财产品类型\t实际投入金额\t实际收回本金\t实际收益\t尚未收回本金金额\n" +
            "1\t结构性存款\t6,000.00\t0\t0\t6,000.00\n" +
            "合计\t6,000.00\t0\t0\t6,000.00\n" +
            "合计\t6,000.00\n" +
            "最近12个月内单日最高投入金额\t6,000.00\n" +
            "最近12个月内单日最高投入金额/最近一年净资产（%）\t8.45%\n" +
            "最近12个月委托理财累计收益/最近一年净利润（%）\t42.24%\n" +
            "目前已使用的理财额度\t6,000.00\n" +
            "尚未使用的理财额度\t29,000.00\n" +
            "总理财额度\t35,000.00\n" +
            "注：上述涉及财务数据以公司2019年合并财务报表为准（经审计）。\n" +
            "\n" +
            "特此公告。\n" +
            "\n" +
            "张家港爱丽家居科技股份有限公司董事会\n" +
            "  二零二零年五月二十二日    \n" +
            "\n";

}
